def a():
    print(x)
def b():
    x = 1
    a()
b()#NameError
'''
Функция b() вызывает ф-ю a(), зоны видимости функций не включены друг в друга. 
Т. е. интерпретатор не найдя имя 'x' в зоне видимости a() перейдёт в глобальную зону видимости, 
потом в зону видимости builtins - и не обнаружит 'x'. В результате: NameError
'''
def b():
    def a():
        print(x)
    x = 1
    a()
b()#1
'''
Функция b() также вызывает ф-ю a(), но теперь a() определена внутри b(). 
Т. е. интерпретатор не найдя имя 'x'  в зоне видимости a() перейдёт в 
зону видимости b() и найдет 'x' . Результат: 1
'''